name: "convolution"
input: "data"
input_dim: 1
input_dim: 1
input_dim: 3
input_dim: 3
layer {
  name: "conv"
  type: "Convolution"
  bottom: "data"
  top: "conv"
  convolution_param {
    num_output: 1
    pad_w: 2
    pad_h: 1
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
